app/Controllers/Users.php

SELECT `distribusi`.*
FROM `distribusi`
WHERE `id` IS NULL
---
    public function index($id = false)
    {

        $distribusi = $this->request->getVar('distribusi');

        $this->builderD = $this->db->table('distribusi');
        $this->builderD->select('distribusi.*');
        $this->builderD->where('id', $distribusi);
        $queryD = $this->builderD->get();

SELECT `users`.`id` as `userid`, `NIK`, `username`, `fullname`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
ORDER BY `fullname`
---
        }

        $this->builder->select('users.id as userid, NIK, username, fullname, email, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');