app/Models/DistribusiModel.php

    public function getDistribusi($id = false)
    {
        if ($id == false) {
            return $this->orderBy('nama_distribusi')->findAll();
---
SELECT *
FROM `distribusi`
ORDER BY `nama_distribusi`