app/Models/ImprovementModel.php

SELECT *
FROM `opl_improvement`
JOIN `distribusi` ON `distribusi`.`id` = `opl_improvement`.`id_distribusi`
WHERE `pembuat` = '1'
ORDER BY `opl_improvement`.`created_at` DESC
---
    public function getImprovementUser()
    {

        return $this->join('distribusi', 'distribusi.id = opl_improvement.id_distribusi')->where(['pembuat' => user_id()])->orderBy('opl_improvement.created_at', 'DESC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `opl_improvement`
WHERE `pembuat` = '1'
---
    public function getCountOPL($id = false)
    {
        return $this->where('pembuat', user()->id)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `opl_improvement`
WHERE `status` LIKE '%Returned%' ESCAPE '!'
AND `pembuat` = '1'
---
    public function getCountReturned($id = false)
    {
        return $this->like('status', 'Returned')->where('pembuat', user()->id)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `opl_improvement`
WHERE `penyetuju` = '1'
AND  `status` LIKE '%Approved%' ESCAPE '!'
---
    public function getCountOPLSupervisor($id = false)
    {
        return $this->where('penyetuju', user()->id)->like('status', 'Approved')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `opl_improvement`
WHERE `status` = 'Created'
AND `id_distribusi` = '2'
---
    public function getCountCreated($id = false)
    {
        return $this->where('status', 'Created')->where('id_distribusi', user()->distribusi)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT COUNT(`id`) AS `id`
FROM `opl_improvement`
WHERE MONTH(created_at) IS NULL
AND YEAR(created_at) IS NULL
AND `id_distribusi` IS NULL
AND `pembuat` IS NULL
OR `penyetuju` IS NULL
OR `engineer` IS NULL
GROUP BY WEEK(created_at)
) CI_count_all_results
---
    public function getCountMonthly($month, $year, $users)
    {
        return $this->selectCount('id')->where('MONTH(created_at)', $month)->where('YEAR(created_at)', $year)->where(['pembuat' => $users])->orwhere(['penyetuju' => $users])->orwhere(['engineer' => $users])->groupBy('WEEK(created_at)')->orderBy('created_at', 'ASC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `opl_improvement`
WHERE MONTH(created_at) IS NULL
AND YEAR(created_at) IS NULL
AND `id_distribusi` IS NULL
AND `pembuat` IS NULL
OR `penyetuju` IS NULL
OR `engineer` IS NULL
---
    public function getTotalMonthly($month, $year, $users)
    {
        return $this->selectCount('id')->where('MONTH(created_at)', $month)->where('YEAR(created_at)', $year)->where(['pembuat' => $users])->orwhere(['penyetuju' => $users])->orwhere(['engineer' => $users])->groupBy('WEEK(created_at)')->orderBy('created_at', 'ASC')->countAllResults();