app/Models/MesinModel.php

    public function getMesin($id = false)
    {
        if ($id == false) {
            return $this->orderBy('nama_mesin')->findAll();
---
SELECT *
FROM `mesin`
ORDER BY `nama_mesin`